// locationData 받을때 닉네임 필요
// search 파람 수정 필요

export const locationData = {
  message: [
    {
      idx: 123,
      line: [
        [127.0276, 37.4979],
        [127.0151, 37.5131],
        [127.0066, 37.527],
        [126.9882, 37.5512],
        [126.977, 37.5665],
        [126.9462, 37.5547],
        [126.9226, 37.5178],
        [126.8965, 37.4849],
        [126.8642, 37.4641],
        [126.8323, 37.4603],
        [126.8071, 37.4473],
        [126.7828, 37.4487],
      ],
      searchpoint: "서울시 종로구",
      center: [126.97, 37.57],
      zoom: 10,
      heading: 250,
      sharing: 0,
      likecount: 121,
      color: 0,
      thickness: 15,
      background: 0,
    },
    {
      idx: 131,
      line: [
        [127.0276, 37.4979],
        [127.0151, 37.5131],
        [127.0066, 37.527],
        [126.9882, 37.5512],
        [126.977, 37.5665],
        [126.9462, 37.5547],
        [126.9226, 37.5178],
        [126.8965, 37.4849],
        [126.8642, 37.4641],
        [126.8323, 37.4603],
        [126.8071, 37.4473],
        [126.7828, 37.4487],
      ],
      searchpoint: "인천광역시 미추홀구",
      center: [126.97, 37.57],
      zoom: 10,
      heading: 250,
      sharing: 0,
      likecount: 223,
      color: 0,
      thickness: 15,
      background: 0,
    },
  ],
};

export const nicknameData = {
  message: [
    {
      idx: 123,
      nickname: "행복한너구리",
      image: "www.s3-urlLink~",
    },
    {
      idx: 125,
      nickname: "못된사마귀",
      image: "www.s3-urlLink~",
    },
  ],
};
